demo/payroll/app/Models/AbsensiModel.php

SELECT `absensi`.*, `karyawan`.`nama`, `karyawan`.`kode_karyawan`
FROM `absensi`
JOIN `karyawan` ON `karyawan`.`id_karyawan` = `absensi`.`id_karyawan`
WHERE MONTH(absensi.tanggal) = 7
AND YEAR(absensi.tanggal) = 2026
---
    public function getWithKaryawan($idKaryawan = null, $bulan = null, $tahun = null)
    {
        $builder = $this->db->table('absensi')
            ->select('absensi.*, karyawan.nama, karyawan.kode_karyawan')
            ->join('karyawan', 'karyawan.id_karyawan = absensi.id_karyawan');

        if ($idKaryawan !== null) {
            $builder->where('absensi.id_karyawan', $idKaryawan);
        }

        if (!empty($bulan)) {
            $builder->where('MONTH(absensi.tanggal)', (int)$bulan, false);
        }

        if (!empty($tahun)) {
            $builder->where('YEAR(absensi.tanggal)', (int)$tahun, false);
        }

        return $builder->get()->getResultArray();