demo/payroll/app/Models/KaryawanModel.php

SELECT `karyawan`.*, `jabatan`.`nama_jabatan`, `jabatan`.`gaji_pokok`, `jabatan`.`tunjangan`, `jabatan`.`tarif_lembur`
FROM `karyawan`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`
---
    public function getWithJabatan($id = null)
    {
        $builder = $this->select('karyawan.*, jabatan.nama_jabatan, jabatan.gaji_pokok, jabatan.tunjangan, jabatan.tarif_lembur')
            ->join('jabatan', 'jabatan.id_jabatan = karyawan.id_jabatan');

        if ($id !== null) {
            return $builder->where('karyawan.id_karyawan', $id)->first();
        }

        return $builder->findAll();