demo/payroll/app/Models/LogAktivitasModel.php

    public function catat(string $aksi, string $modul, string $keterangan = '', ?array $pelaku = null): void
    {
        $this->insert([
            'id_user'    => $pelaku['id_user'] ?? session()->get('id_user'),
            'username'   => $pelaku['username'] ?? session()->get('username'),
            'role'       => $pelaku['role'] ?? session()->get('role'),
            'aksi'       => $aksi,
            'modul'      => $modul,
            'keterangan' => $keterangan,
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `log_aktivitas` (`id_user`, `username`, `role`, `aksi`, `modul`, `keterangan`, `created_at`) VALUES ('1', 'owner', 'Owner', 'Login', 'Auth', 'Login sebagai Owner.', '2026-08-04 14:47:45')

    public function getTerbaru()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `log_aktivitas`
ORDER BY `created_at` DESC