demo/payroll/app/Models/PenggajianModel.php

SELECT `penggajian`.*, `karyawan`.`nama`, `karyawan`.`kode_karyawan`, `karyawan`.`nama_bank`, `karyawan`.`nomor_rekening`, `jabatan`.`nama_jabatan`
FROM `penggajian`
JOIN `karyawan` ON `karyawan`.`id_karyawan` = `penggajian`.`id_karyawan`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `karyawan`.`id_jabatan`
WHERE `penggajian`.`bulan` = 7
AND `penggajian`.`tahun` = 2026
ORDER BY `penggajian`.`tanggal_gaji` DESC
---
    public function getFiltered(?int $bulan = null, ?int $tahun = null, ?string $tipe = null)
    {
        $builder = $this->select('penggajian.*, karyawan.nama, karyawan.kode_karyawan, karyawan.nama_bank, karyawan.nomor_rekening, jabatan.nama_jabatan')
            ->join('karyawan', 'karyawan.id_karyawan = penggajian.id_karyawan')
            ->join('jabatan', 'jabatan.id_jabatan = karyawan.id_jabatan');

        if (! empty($bulan)) {
            $builder->where('penggajian.bulan', $bulan);
        }

        if (! empty($tahun)) {
            $builder->where('penggajian.tahun', $tahun);
        }

        if ($tipe === 'admin' || $tipe === 'karyawan') {
            $adminKaryawanIds = (new UserModel())->getAdminKaryawanIds();

            if ($tipe === 'admin') {
                if (empty($adminKaryawanIds)) {
                    // Belum ada karyawan yang punya akun Admin -> hasil kosong.
                    $builder->where('penggajian.id_karyawan', -1);
                } else {
                    $builder->whereIn('penggajian.id_karyawan', $adminKaryawanIds);
                }
            } elseif (! empty($adminKaryawanIds)) {
                $builder->whereNotIn('penggajian.id_karyawan', $adminKaryawanIds);
            }
        }

        return $builder->orderBy('penggajian.tanggal_gaji', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `penggajian`
WHERE `bulan` = 7
AND `tahun` = 2026
---
    public function countKaryawanDigaji(int $bulan, int $tahun): int
    {
        return $this->where('bulan', $bulan)
            ->where('tahun', $tahun)
            ->countAllResults();