demo/payroll/app/Models/ResetPasswordRequestModel.php

SELECT COUNT(*) AS `numrows`
FROM `reset_password_request`
JOIN `users` ON `users`.`id_user` = `reset_password_request`.`id_user`
WHERE `status` = 'Pending'
AND `users`.`role` = 'Admin'
---
    public function countPending(?string $role = null): int
    {
        $builder = $this->where('status', 'Pending');

        if ($role !== null) {
            $builder->join('users', 'users.id_user = reset_password_request.id_user')
                ->where('users.role', $role);
        }

        return $builder->countAllResults();