demo/payroll/app/Models/UserModel.php

    public function findByUsername(string $username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'owner'
 LIMIT 1

    public function getKaryawanAccountsWithKaryawan()
    {
        return $this->select('users.*, karyawan.nama as nama_karyawan, karyawan.kode_karyawan')
            ->join('karyawan', 'karyawan.id_karyawan = users.id_karyawan', 'left')
            ->where('users.role', 'Karyawan')
            ->findAll();
---
SELECT `users`.*, `karyawan`.`nama` as `nama_karyawan`, `karyawan`.`kode_karyawan`
FROM `users`
LEFT JOIN `karyawan` ON `karyawan`.`id_karyawan` = `users`.`id_karyawan`
WHERE `users`.`role` = 'Karyawan'