demo/payroll/app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows`
FROM `karyawan`
SELECT COUNT(*) AS `numrows`
FROM `penggajian`
WHERE MONTH(tanggal_gaji) = '7'
AND YEAR(tanggal_gaji) = '2026'
---
    public function index()
    {
        $role = session()->get('role');

        $karyawanModel   = new KaryawanModel();
        $absensiModel    = new AbsensiModel();
        $penggajianModel = new PenggajianModel();

        $data = ['role' => $role];

        if ($role === 'Owner') {
            $data['total_karyawan']  = $karyawanModel->countAllResults();
            $data['total_penggajian_bulan_ini'] = $penggajianModel
                ->where('MONTH(tanggal_gaji)', date('n'))
                ->where('YEAR(tanggal_gaji)', date('Y'))
                ->countAllResults();