demo/payroll/app/Controllers/PenggajianController.php

    public function index()
    {
        $bulan = (int) ($this->request->getGet('bulan') ?? date('n'));
        $tahun = (int) ($this->request->getGet('tahun') ?? date('Y'));
        $tipe  = session()->get('role') === 'Owner' ? $this->request->getGet('tipe') : null;

        return view('penggajian/index', [
            'data'          => $this->model->getFiltered($bulan, $tahun, $tipe),
            'bulan'         => $bulan,
            'tahun'         => $tahun,
            'tipe'          => $tipe,
            'totalKaryawan' => (new KaryawanModel())->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `karyawan`